Repository: OmegaT-L10N/fr
Catalog: tm/auto/App_Acknowledgments_App-Keyboard.tmx
Source language: en
Languages: fr

source: * These keys behave differently when the cursor is outside the editable segment:
fr: * Ces touches ont un comportement différent lorsque le curseur est à l'extérieur du segment modifiable:

source: Any char key, if clicked outside editable segment, will be ignored.
fr: Un appui sur n'importe qu'elle autre touche à l'extérieur du segment modifiable sera ignoré.

source: Backspace: nothing
fr: Retour arrière : rien ne se passe

source: Delete: nothing
fr: Supprimer : rien ne se passe

source: End: cursor to the end of the active segment
fr: Fin : déplacement du curseur à la fin du segment actif

source: Home: cursor to the beginning of the active segment
fr: Début : déplacement du curseur au début du segment actif

source: Project Properties Languages
fr: Projet Propriétés Langues

source: Abkhaz
fr: Abkhaze

source: Acknowledgements
fr: Remerciements

source: Albanian
fr: Albanais

source: Amharic
fr: Amharique

source: Arabic
fr: Arabe

source: Aragonese
fr: Aragonais

source: Armenian
fr: Arménien

source: Assamese
fr: Assamais

source: Avaric
fr: Avar

source: Avestan
fr: Avestique

source: Azerbaijani
fr: Azerbaïdjanais

source: Backspace*
fr: Retour arrière*

source: Belarusian
fr: Biélorusse

source: Bislama
fr: Bichelamar

source: Bosnian
fr: Bosnien

source: Bulgarian
fr: Bulgare

source: Burmese
fr: Birman

source: Chechen
fr: Tchètchène

source: Chinese
fr: Chinois

source: Chuvash
fr: Tchouvache

source: Cornish
fr: Cornique

source: Corsican
fr: Corse

source: Cree
fr: Cri

source: Croatian
fr: Croate

source: Ctrl+Backspace
fr: Ctrl+Retour arrière

source: Ctrl+Delete
fr: Ctrl+Supprimer

source: Ctrl+End
fr: Ctrl+Fin

source: Ctrl+Enter
fr: Ctrl+Entrée

source: Ctrl+Home
fr: Ctrl+Début

source: Ctrl+Left:
fr: Ctrl+Gauche :

source: Ctrl+PgDn
fr: Ctrl+Pg suiv

source: Ctrl+PgUp
fr: Ctrl+Pg préc

source: Ctrl+Right:
fr: Ctrl+Droite :

source: Ctrl+Shift+O
fr: Ctrl+Maj+O

source: Czech
fr: Tchèque

source: Danish
fr: Danois

source: Delete*
fr: Supprimer*

source: Didier Briel: I could not do without Didier's patient and persistent help with DocBook intricacies.
fr: Didier Briel : Je n'aurais rien pu faire sans I'aide patiente et persistante que Didier m'a apportée face à la complexité de DocBook.

source: Divehi, Dhivehi, Maldivian
fr: Divehi, Dhivehi, Maldivien

source: Dutch
fr: Néerlandais

source: End*
fr: Fin*

source: English
fr: Anglais

source: Estonian
fr: Estonien

source: Explicit thanks to:
fr: J'exprime donc ma gratitude à :

source: Faroese
fr: Féroïen

source: Fijian
fr: Fidjien

source: Finnish
fr: Finnois

source: French
fr: Français

source: Fula, Fulah, Pulaar, Pular
fr: Peul, Peulh, Pulaar, Pularl

source: Galician
fr: Galicien

source: Georgian
fr: Géorgien

source: German
fr: Allemand

source: Greek, Modern
fr: Grec oderne

source: Haitian, Haitian Creole
fr: Haïtien, Créole

source: Hausa
fr: Haoussa

source: Hebrew (modern)
fr: Hebreu (moderne)

source: Herero
fr: Héréro

source: Hiri Motu
fr: Hiri Motou

source: Home*
fr: Début*

source: Hungarian
fr: Hongrois

source: ISO 639-1/639-2 Language code list
fr: Liste des codes langues ISO 639-1/639-2

source: ISO language codes
fr: Codes langues ISO

source: Icelandic
fr: Islandais

source: Indonesian
fr: Indonesien

source: Inupiaq
fr: Inupiak

source: Irish
fr: Irlandais

source: Italian
fr: Italien

source: Japanese
fr: Japonais

source: Javanese
fr: Javanais

source: Jean-Christophe Helary: special thanks to JC for his concise description of OmegaT run, command line parameters and all other details, I have yet to notice.
fr: Jean-Christophe Helary: remerciements particuliers à JC pour sa description concise de l'éxécution d'OmegaT, des paramètres de ses lignes de commandes et de tous les autres petits détails que je n'ai pas encore repérés.

source: Kalaallisut, Greenlandic
fr: Kalaallisut, Groenlandais

source: Kanuri
fr: Kanouri

source: Kashmiri
fr: Cachemiri

source: Keep up your good work!
fr: Continuez votre excellent travail !

source: Key behavior in the editor
fr: Comportement des touches dans le volet d'édition

source: Key combination
fr: Combinaison de touches

source: Keyboard shortcuts in the editor
fr: Raccourcis clavier dans le volet d'édition

source: Kirghiz, Kyrgyz
fr: Kirghiz, Kirghize

source: Kongo
fr: Kikongo

source: Korean
fr: Coréen

source: Kurdish
fr: Kurde

source: Kwanyama, Kuanyama
fr: Kuanyama

source: Language name
fr: Nom de la langue

source: Languages
fr: Langues

source: Languages - ISO 639 code list
fr: Langues - Liste de codes ISO 639

source: Last but not least: my thanks to all the contributors to OmegaT documentation tracker for all the inconsistencies found in the previous versions of the documentation.
fr: Dernier remerciement mais non des moindres: je remercie tous ceux qui ont contribué à l'analyse du manuel d'OmegaT pour toutes les incohérences qu'ils ont trouvées dans ses précédentes versions.

source: Left:
fr: Gauche :

source: Limburgish, Limburgan, Limburger
fr: Limbourgeois

source: Luxembourgish, Letzeburgesch
fr: Luxembourgeois, Letzeburgesch

source: Mark Prior: correcting my first draft was an act of love for OmegaT and the English language.
fr: Mark Prior : corriger ma première ébauche a été un acte d'amour pour OmegaT et la langue anglaise.

source: Not to mention his care and diligence, keeping repositories intact and in good order.
fr: Sans parler des soins et du zèle dont il a fait preuve pour protéger les référentiels et les tenir en ordre.

source: Note that you can reassign the shortcuts to your own preferences.
fr: Notez que vous pouvez reprogrammer les raccourcis selon vos préférences.

source: One could only wonder, how many the and a prepositions would still be missing without his invaluable help.
fr: Je ne peux qu'imaginer le nombre de prépositions qui manqueraient encore si je n'avais pas bénéficié de son aide précieuse.

source: PgDn:
fr: Pg suiv :

source: PgUp:
fr: Pg préc :

source: Please check the ISO 639 Code Tables for further and up-to-date information about language codes.
fr: Merci de vérifier le Tableau de Codes ISO 639 pour des informations complémentaires et actualisées à propos des codes langues.

source: RTL-LTR switch
fr: Passage du mode de lecture droite-à-gauche au mode de lecture gauche-à-droite (et inversement)

source: Right:
fr: Droite :

source: Samuel Murray: for the introductory chapter "Learn to use OmegaT in 5 minutes".
fr: Samuel Murray : pour le chapitre d'introduction "Apprenez à utiliser OmegaT en 5 minutes".

source: See Appendix ShortCut Customization
fr: Voir Annexe Peronnalisation des Raccourcis

source: System-wide commands Select All (Ctrl+A), Paste (Ctrl+V), Cut (Ctrl+X), copy (Ctrl+C), Insert match (Ctrl+I) and Insert source (Ctrl+Shift+I) act in principle on the text within the currently open segment only.
fr: Les commandes utilisées pour l'ensemble du système, Tout sélectionner (Ctrl+A), Coller (Ctrl+V), Couper (Ctrl+X), Copier (Ctrl+C), Insérer la correspondance (Ctrl+I) et Insérer le texte source (Ctrl+Maj+I) fonctionnent en principe sur le texte, mais uniquement à l'intérieur du segment ouvert.

source: Thank you all!
fr: Merci à tous !!

source: The "Shift" key doesn't exhibit any special behavior per se: when the "Shift" key is pressed, all keys move the cursor in their usual manner, except in the case of the Shift+Enter combination, that inserts a line brak into the text.
fr: En elle-même, la touche "Maj" ne provoque pas de comportement particulier : lorsque la touche "Maj" est appuyée, toutes les touches déplacent le curseur de manière habituelle, à l'exception de la combinaison Maj+Entrée qui insère un retour à la ligne dans le texte.

source: The term "Move to inside segment" means, that the cursor moves to the beginning of the segment if it was previously before the segment, and to the end of the segment if it was previously after it.
fr: Le terme "Déplacement vers l'intérieur du segment" signifie que le curseur ira se placer au début du segment actif s'il est positionné avant celui-ci, et qu'il ira se placer à la fin du segment actif s'il est positionné après.

source: This manual, however, would not be possible without the help and support from a number of people.
fr: Cependant, ce manuel n'aurait pas pu voir le jour sans l'aide et le soutien d'un grand nombre de personnes.

source: This short text describes key behavior in the editor pane.
fr: Ce petit texte décrit le comportement des touches dans le volet d'édition.

source: Whatever the inconsistencies, omissions and straightforward errors you may find in the present version, I declare them all my own.
fr: Quelles que soient les incohérences, omissions et simples erreurs que pourriez trouver dans cette version, je tiens à déclarer que j'en assume l'entière responsabilité.

source: Will Helton: his final reading of the draft has spared me a lot of embarrassment.
fr: Will Helton : sa lecture finale du projet m'a évité de nombreux désagréments.

source: move to the beginning of the line in the segment
fr: déplacement au début de la ligne à l'intérieur du segment

source: move to the end of the document (Mac: Cmd+PgDn)
fr: déplacement à la fin du document (Mac: Cmd+Pg suiv)

source: move to the end of the line in the segment
fr: déplacement à la fin de la ligne à l'intérieur du segment

source: move to the end of the segment
fr: déplacement à la fin du segment

source: move to the start of the document (Mac: Cmd+PgUp)
fr: déplacement au début du document (Mac: Cmd+Pg préc)

source: move to the start of the segment
fr: déplacement au début du segment

source: one char left, but not further than the beginning of segment
fr: déplacement d'un caractère sur la gauche mais qui ne va pas plus loin que le début du segment

source: one char right, but not further than the end of segment
fr: déplacement d'un caractère sur la droite mais qui ne va pas plus loin que la fin du segment

source: one word left, but not further than the beginning of segment
fr: déplacement d'un mot sur la gauche mais qui ne va pas plus loin que le début du segment

source: one word right, but not further than the end of segment
fr: déplacement d'un mot sur la droite mais qui ne va pas plus loin que la fin du segment

source: open previous segment (Mac: Cmd+Enter)
fr: ouvre le segment précédent (Mac: Cmd+Enter)

source: page down through the document
fr: le document défile vers le bas

source: page up through the document
fr: le document défile vers le haut

source: remove char after cursor
fr: supprime le caractère placé après le curseur

source: remove char before cursor
fr: supprime le caractère placé avant le curseur

source: remove chars up to the start of next word (Mac: Alt+Delete)
fr: supprime tous les caractères du mot placé après le curseur (Mac: Alt+Supprimer)

source: remove chars up to the start of the current word (Mac: Alt+Backspace)
fr: supprime tous les caractères du mot placé avant le curseur (Mac: Alt+Retour arrière)

source: select complete segment (Mac: Cmd+A)
fr: sélectionne le segment complet (Mac: Cmd+A)
